{
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "ConditionalDetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "backbone_config": null,
  "backbone_kwargs": {
    "in_chans": 3,
    "out_indices": [
      1,
      2,
      3,
      4
    ]
  },
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 2,
  "cls_loss_coefficient": 2,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "dtype": "float32",
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "focal_alpha": 0.25,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "clothing-shoes",
    "1": "Tshirt",
    "2": "long-dress",
    "3": "long-skirt",
    "4": "midi-dress",
    "5": "midi-skirt",
    "6": "pants",
    "7": "shirt",
    "8": "short",
    "9": "short-dress",
    "10": "short-skirt",
    "11": "sweater"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "Tshirt": 1,
    "clothing-shoes": 0,
    "long-dress": 2,
    "long-skirt": 3,
    "midi-dress": 4,
    "midi-skirt": 5,
    "pants": 6,
    "shirt": 7,
    "short": 8,
    "short-dress": 9,
    "short-skirt": 10,
    "sweater": 11
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "conditional_detr",
  "num_channels": 3,
  "num_hidden_layers": 6,
  "num_queries": 300,
  "position_embedding_type": "sine",
  "scale_embedding": false,
  "transformers_version": "4.57.1",
  "use_pretrained_backbone": true,
  "use_timm_backbone": true
}
